[
    {
        "name": "ACQUIRED",
        "description": "One entity purchasing another entity, typically involving the transfer of ownership and control. This includes mergers, acquisitions, and buying majority stakes.",
        "examples": [
            "The parent company completed the purchase of a fitness technology subsidiary.",
            "The enterprise software company signed a definitive agreement to acquire a collaboration platform."
        ]
    },
    {
        "name": "SUED",
        "description": "One entity initiating legal proceedings against another entity. This includes filing lawsuits, patent disputes, and other legal complaints.",
        "examples": [
            "The autonomous vehicle company filed a legal complaint against a competitor alleging theft of trade secrets.",
            "The game developer took the platform operator to court over marketplace fees and policies."
        ]
    },
    {
        "name": "PARTNERED",
        "description": "Two or more entities agreeing to cooperate to advance their mutual interests. This includes strategic alliances, joint ventures, and collaboration agreements.",
        "examples": [
            "The technology company and AI research lab announced a multi-year agreement to accelerate AI breakthroughs.",
            "The coffee chain and music streaming service joined forces to create a music ecosystem for retail stores."
        ]
    },
    {
        "name": "INVESTED",
        "description": "One entity allocating capital to another entity with the expectation of a future financial return. This includes venture capital funding, equity stakes, and buying shares.",
        "examples": [
            "The investment conglomerate bought a significant stake in the cloud company prior to its IPO.",
            "The venture capital firm led the Series A funding round for the new startup."
        ]
    },
    {
        "name": "DIVESTED",
        "description": "One entity disposing of a business unit, subsidiary, or investment. This includes spin-offs, selling off assets, or reducing ownership stakes.",
        "examples": [
            "The e-commerce company spun off its payments division into a separate publicly traded company.",
            "The industrial conglomerate sold its biopharma business to a life sciences company."
        ]
    },
    {
        "name": "HIRED",
        "description": "An entity employing a person, often an executive or key figure, from another entity or generally.",
        "examples": [
            "The ride-sharing company appointed a former travel company CEO as its new Chief Executive Officer.",
            "The electric vehicle manufacturer recruited a top battery researcher from a university."
        ]
    },
    {
        "name": "REGULATED",
        "description": "A government or regulatory body imposing rules, fines, or restrictions on an entity. This includes antitrust actions, investigations, and compliance orders.",
        "examples": [
            "The regulatory commission fined the technology company for antitrust violations related to its mobile operating system.",
            "The securities regulator charged the exchange with operating an unregistered securities offering."
        ]
    },
    {
        "name": "LAUNCHED_PRODUCT",
        "description": "An entity introducing a new product or service to the market.",
        "examples": [
            "The consumer electronics company unveiled a new mixed reality headset at its annual developer conference.",
            "The e-commerce giant rolled out a new healthcare service for subscription members."
        ]
    },
    {
        "name": "EXPANDED",
        "description": "An entity increasing its operations, physical footprint, or market presence. This includes opening new offices, entering new countries, or increasing production capacity.",
        "examples": [
            "The automaker opened a new manufacturing facility in Europe to serve the regional market.",
            "The streaming service launched in 130 new countries simultaneously."
        ]
    },
    {
        "name": "CLOSED",
        "description": "An entity shutting down operations, branches, or product lines. This includes store closures, discontinuing services, or ceasing business.",
        "examples": [
            "The technology company announced it would shut down its internal game development studios.",
            "The department store chain plans to close 125 locations over the next three years."
        ]
    },
    {
        "name": "REPORTED_FINANCIALS",
        "description": "An entity releasing its periodic financial results. This includes earnings reports, 10-Ks, 10-Qs, and revenue figures.",
        "examples": [
            "The semiconductor company reported quarterly revenue exceeding analyst estimates.",
            "The automaker posted a decline in gross margins for the fiscal year."
        ]
    },
    {
        "name": "ISSUED_GUIDANCE",
        "description": "An entity providing forward-looking projections about its future performance. This includes raising or lowering revenue forecasts or EPS targets.",
        "examples": [
            "The retailer warned of softer sales in the upcoming holiday quarter.",
            "The software company raised its full-year revenue outlook citing strong cloud demand."
        ]
    },
    {
        "name": "DECLARED_DIVIDEND",
        "description": "An entity announcing a payment to shareholders. This includes regular cash dividends, special dividends, or suspending dividends.",
        "examples": [
            "The automaker declared a supplemental dividend of 18 cents per share.",
            "The entertainment company announced it would reinstate its cash dividend after a three-year pause."
        ]
    },
    {
        "name": "AUTHORIZED_BUYBACK",
        "description": "An entity announcing a plan to repurchase its own shares. This includes share repurchase programs and ASRs.",
        "examples": [
            "The energy company announced a new multi-billion dollar share buyback program.",
            "The technology company authorized additional funds for share repurchases."
        ]
    },
    {
        "name": "ISSUED_DEBT",
        "description": "An entity raising capital by selling bonds or taking out loans. This includes notes offerings, credit facilities, and refinancing.",
        "examples": [
            "The enterprise software company sold bonds to fund its healthcare acquisition.",
            "The crypto exchange raised capital through a convertible notes offering."
        ]
    },
    {
        "name": "DEFAULTED",
        "description": "An entity failing to meet its debt obligations. This includes missing interest payments or principal repayments.",
        "examples": [
            "The property developer missed a crucial interest payment on its offshore bonds.",
            "The country defaulted on its sovereign debt for the first time in a century."
        ]
    },
    {
        "name": "FILED_BANKRUPTCY",
        "description": "An entity legally declaring inability to pay its debts. This includes Chapter 11 reorganization or Chapter 7 liquidation.",
        "examples": [
            "The crypto exchange filed for Chapter 11 bankruptcy protection.",
            "The co-working company officially filed for bankruptcy after years of struggles."
        ]
    },
    {
        "name": "SETTLED_LEGAL_DISPUTE",
        "description": "An entity resolving a legal dispute, usually by paying a sum of money, without admitting liability. This includes class action settlements.",
        "examples": [
            "The social media company agreed to pay to settle a privacy lawsuit.",
            "The e-cigarette manufacturer settled thousands of lawsuits related to its marketing practices."
        ]
    },
    {
        "name": "GRANTED_PATENT",
        "description": "An entity receiving official rights to an invention or intellectual property.",
        "examples": [
            "The technology company was granted a patent for a quantum computing processor.",
            "The consumer electronics maker received a patent for a foldable display mechanism."
        ]
    },
    {
        "name": "RECALLED_PRODUCT",
        "description": "An entity requesting the return of a product due to safety concerns or defects.",
        "examples": [
            "The automaker recalled 1 million vehicles due to a potential airbag defect.",
            "The fitness equipment company recalled its treadmill following safety reports."
        ]
    },
    {
        "name": "EXPERIENCED_DATA_BREACH",
        "description": "An entity suffering a security incident where sensitive data was accessed without authorization.",
        "examples": [
            "The telecom company revealed a data breach affecting millions of customer accounts.",
            "The hospitality company suffered a cyberattack that disrupted its operations for days."
        ]
    },
    {
        "name": "EXECUTIVE_RESIGNATION",
        "description": "A key executive or board member stepping down from their position.",
        "examples": [
            "The founder stepped down as CEO to become Executive Chairman.",
            "The CFO resigned unexpectedly citing personal reasons."
        ]
    },
    {
        "name": "ANALYST_RATING_CHANGE",
        "description": "An external financial analyst changing their investment recommendation or price target for an entity.",
        "examples": [
            "The investment bank upgraded the streaming company to 'Buy' from 'Neutral'.",
            "The analyst firm downgraded the chipmaker citing inventory concerns."
        ]
    },
    {
        "name": "RAISED_POLICY_RATE",
        "description": "A central bank increasing its benchmark interest rate to curb inflation or cool the economy.",
        "examples": [
            "The central bank raised its benchmark interest rate by 25 basis points.",
            "The monetary authority hiked rates to combat soaring inflation."
        ]
    },
    {
        "name": "LOWERED_POLICY_RATE",
        "description": "A central bank decreasing its benchmark interest rate to stimulate economic growth.",
        "examples": [
            "The central bank cut interest rates to support the economy.",
            "The monetary authority lowered its lending rate to boost the property sector."
        ]
    },
    {
        "name": "REPORTED_ECONOMIC_DATA",
        "description": "A government agency or organization releasing key economic indicators such as GDP, CPI, unemployment, or retail sales.",
        "examples": [
            "The labor statistics agency reported that the economy added hundreds of thousands of jobs.",
            "The government reported quarterly GDP growth exceeding expectations."
        ]
    },
    {
        "name": "IMPOSED_SANCTIONS",
        "description": "A government or international body applying commercial and financial penalties against a targeted entity or country.",
        "examples": [
            "The US imposed new sanctions on several Russian banks.",
            "The EU announced trade restrictions on companies aiding the conflict."
        ]
    },
    {
        "name": "ESTABLISHED_SUBSIDIARY",
        "description": "An entity creating a new separate legal entity to handle specific operations, often in a new region or sector.",
        "examples": [
            "The parent company established a standalone subsidiary for autonomous vehicle technology.",
            "The e-commerce conglomerate set up a new logistics subsidiary to handle international shipping."
        ]
    },
    {
        "name": "INTEGRATED_SUBSIDIARY",
        "description": "An entity merging a subsidiary back into the parent company or consolidating operations.",
        "examples": [
            "The software company integrated its recent acquisition into its healthcare division.",
            "The entertainment company consolidated its streaming services under a single media division."
        ]
    },
    {
        "name": "SPUN_OFF",
        "description": "An entity creating an independent company from an existing division or subsidiary, distributing shares to existing shareholders.",
        "examples": [
            "The pharmaceutical company spun off its consumer health business as a separate entity.",
            "The automaker spun off its commercial vehicle division into a separate listed company."
        ]
    },
    {
        "name": "REPORTED_WAGE_PRESSURE_EASING",
        "description": "A report stating that the rate of wage growth is slowing down or that pressure to raise wages has diminished. A key inflation signal.",
        "examples": [
            "Contacts noted that wage pressures were easing as the supply of labor improved.",
            "Firms reported that wage growth had moderated back to pre-pandemic levels."
        ]
    },
    {
        "name": "REPORTED_WAGE_PRESSURE_RISING",
        "description": "A report stating that businesses are facing increasing pressure to raise wages to attract or retain talent.",
        "examples": [
            "Manufacturers reported continued upward pressure on wages due to skilled labor shortages.",
            "Service firms raised starting wages significantly to compete for workers."
        ]
    },
    {
        "name": "REPORTED_LABOR_MARKET_SOFTENING",
        "description": "A report indicating that hiring has slowed, turnover has decreased, or it has become easier to find workers.",
        "examples": [
            "Hiring activity slowed across the district as firms became more cautious.",
            "Contacts reported that it was easier to fill open positions than in previous months."
        ]
    },
    {
        "name": "REPORTED_PRICING_POWER_EROSION",
        "description": "A report stating that businesses are unable to pass on higher costs to consumers due to pushback or competition.",
        "examples": [
            "Retailers noted that customers were becoming more price-sensitive, limiting their ability to raise prices.",
            "Firms reported that they had to absorb higher input costs as pricing power eroded."
        ]
    },
    {
        "name": "REPORTED_CONSUMER_TRADING_DOWN",
        "description": "A report indicating that consumers are shifting purchases to cheaper alternatives or discount brands. A classic recessionary signal.",
        "examples": [
            "Grocery stores reported that shoppers were trading down to private-label brands.",
            "Discretionary spending shifted towards lower-cost entertainment options."
        ]
    },
    {
        "name": "REPORTED_CREDIT_QUALITY_DETERIORATION",
        "description": "A report indicating a rise in delinquencies, defaults, or a decline in the creditworthiness of borrowers.",
        "examples": [
            "Banks reported a slight uptick in delinquencies for subprime auto loans.",
            "Credit card delinquency rates rose above pre-pandemic levels."
        ]
    },
    {
        "name": "REPORTED_LENDING_STANDARDS_TIGHTENING",
        "description": "A report stating that banks are making it harder to get loans by increasing requirements or reducing limits.",
        "examples": [
            "Lenders tightened standards for commercial real estate loans due to valuation concerns.",
            "Banks reported stricter collateral requirements for business loans."
        ]
    },
    {
        "name": "REPORTED_CRE_DISTRESS",
        "description": "A report highlighting specific stress in the Commercial Real Estate (CRE) sector, such as high vacancies or valuation drops.",
        "examples": [
            "Office vacancy rates remained high, leading to distress in the downtown CRE market.",
            "Contacts reported difficulty refinancing maturing office building loans."
        ]
    },
    {
        "name": "REPORTED_INVENTORY_BUILDUP",
        "description": "A report stating that businesses have more inventory than desired, often leading to discounting.",
        "examples": [
            "Retailers reported excess inventory in apparel and home goods.",
            "Manufacturers noted an unintended buildup of finished goods as demand slowed."
        ]
    },
    {
        "name": "REPORTED_CAPEX_DELAY",
        "description": "A report stating that businesses are postponing or cancelling planned capital expenditures due to uncertainty or high interest rates.",
        "examples": [
            "Many firms reported pausing construction projects due to high financing costs.",
            "Capital spending plans were scaled back amid economic uncertainty."
        ]
    },
    {
        "name": "REPORTED_OUTLOOK_UNCERTAINTY",
        "description": "A report stating that business confidence has waned or that the future economic outlook has become more uncertain.",
        "examples": [
            "Contacts expressed increased pessimism about the economic outlook for the next six months.",
            "Uncertainty regarding the election caused firms to delay strategic decisions."
        ]
    },
    {
        "name": "REPORTED_ECONOMIC_ACTIVITY",
        "description": "General statements about the overall speed or health of the economy (e.g., growth, stagnation, recession).",
        "examples": [
            "Economic activity was little changed.",
            "The pace of growth decelerated."
        ]
    },
    {
        "name": "REPORTED_LABOR_CONDITIONS",
        "description": "Statements regarding employment levels, hiring difficulties, turnover, or labor supply.",
        "examples": [
            "Hiring was flat.",
            "Firms reported difficulty finding skilled workers."
        ]
    },
    {
        "name": "REPORTED_WAGE_TRENDS",
        "description": "Specific reporting on salary changes, wage pressures, or compensation costs. (Distinct from general labor conditions).",
        "examples": [
            "Wage growth moderated.",
            "Starting salaries rose 10%."
        ]
    },
    {
        "name": "REPORTED_PRICE_PRESSURES",
        "description": "Statements regarding inflation, input costs, or selling prices.",
        "examples": [
            "Input costs rose due to tariffs.",
            "Selling prices held steady."
        ]
    },
    {
        "name": "REPORTED_CONSUMER_SPENDING",
        "description": "Trends in retail, tourism, hospitality, and general consumer demand.",
        "examples": [
            "Retailers noted softer demand for discretionary items.",
            "Tourism activity exceeded expectations."
        ]
    },
    {
        "name": "REPORTED_CREDIT_CONDITIONS",
        "description": "Banking sector reports on loan volume, credit quality, delinquency, or lending standards.",
        "examples": [
            "Loan demand fell due to high rates.",
            "Credit quality remained healthy."
        ]
    },
    {
        "name": "REPORTED_REAL_ESTATE",
        "description": "Specifics on commercial or residential real estate markets, construction, and leasing.",
        "examples": [
            "Commercial office vacancy rates remained high.",
            "Home sales were flat."
        ]
    },
    {
        "name": "CAUSED",
        "description": "One event, action, or entity directly causing another event, state, or outcome. A fundamental cause-and-effect relationship.",
        "examples": [
            "The software update caused the system to crash.",
            "High winds caused power outages across the region.",
            "The executive's comments caused the stock price to drop."
        ]
    },
    {
        "name": "EFFECTED_BY",
        "description": "An event, state, or outcome that is the direct result of another event, action, or entity. The passive form of CAUSED.",
        "examples": [
            "The system crash was effected by the software update.",
            "Power outages were effected by high winds.",
            "The drop in stock price was effected by the executive's comments."
        ]
    },
    {
        "name": "CONTRIBUTED_TO",
        "description": "An event or factor that played a part in bringing about a result, but was not the sole cause.",
        "examples": [
            "Rising interest rates contributed to the slowdown in housing sales.",
            "Supply chain disruptions contributed to the lower quarterly revenue.",
            "Strong marketing contributed to the product's success."
        ]
    },
    {
        "name": "PREVENTED",
        "description": "An action or event that stopped another event or outcome from happening.",
        "examples": [
            "The safety mechanism prevented a catastrophic failure.",
            "Early intervention prevented the spread of the virus.",
            "Regulatory hurdles prevented the merger from completing."
        ]
    },
    {
        "name": "HEADQUARTERED_IN",
        "description": "An organization having its main office or headquarters located in a specific place (city, state, country).",
        "examples": [
            "The technology company is headquartered in Silicon Valley.",
            "The company's global headquarters are located in a major financial center.",
            "The bank's corporate headquarters is in the Southeast."
        ]
    },
    {
        "name": "HAS_TICKER",
        "description": "An organization having a specific stock ticker symbol used for trading on exchanges.",
        "examples": [
            "The holding company trades under multiple ticker symbols for different share classes.",
            "The company's stock is listed on a major exchange.",
            "The automaker's ticker symbol is widely recognized by investors."
        ]
    },
    {
        "name": "TRADES_ON",
        "description": "An organization's stock being listed and traded on a specific stock exchange.",
        "examples": [
            "The technology company trades on a major US stock exchange.",
            "The company is listed on the New York Stock Exchange.",
            "The firm went public on the London Stock Exchange."
        ]
    },
    {
        "name": "HAS_MOTTO",
        "description": "An organization adopting or using a specific slogan, motto, or tagline.",
        "examples": [
            "The search company's informal motto emphasized ethical behavior.",
            "The parent company's corporate code of conduct promotes integrity.",
            "The sportswear company's famous slogan is recognized worldwide."
        ]
    },
    {
        "name": "FOUNDED_IN",
        "description": "An organization being established or incorporated in a specific year or time period.",
        "examples": [
            "The search engine company was founded in the late 1990s.",
            "The holding company was created as a corporate restructuring.",
            "The company was established in the early 2000s."
        ]
    },
    {
        "name": "OPERATES_IN",
        "description": "An organization conducting business or having operations in a specific geographic region, country, or market.",
        "examples": [
            "The technology company operates in over 100 countries worldwide.",
            "The company has significant operations in Asia Pacific.",
            "The conglomerate operates across North America, Europe, and emerging markets."
        ]
    },
    {
        "name": "HAS_WEBSITE",
        "description": "An organization's official website or web domain.",
        "examples": [
            "The search company's website is its primary product.",
            "The company's official website provides corporate information.",
            "Investors can find information on the investor relations website."
        ]
    },
    {
        "name": "LED_BY",
        "description": "An organization being managed or led by a specific person in a leadership role (CEO, CFO, President, Chairman, etc.).",
        "examples": [
            "The technology company is led by its current CEO.",
            "The company is headed by its founder and executive chairman.",
            "The CFO serves as President and Chief Financial Officer."
        ]
    },
    {
        "name": "OFFERS_PRODUCT",
        "description": "An organization providing or selling a specific product to customers.",
        "examples": [
            "The technology company offers a popular web browser.",
            "The company offers cloud computing platform for enterprise customers.",
            "The company offers a range of consumer electronics devices."
        ]
    },
    {
        "name": "PROVIDES_SERVICE",
        "description": "An organization delivering a specific service to users or customers.",
        "examples": [
            "The search company provides internet search services.",
            "The video platform provides streaming and hosting services.",
            "The cloud division provides computing and storage services."
        ]
    },
    {
        "name": "REVEALED",
        "description": "A person or organization publicly disclosing or revealing previously unknown information, a decision, an inspiration, or internal details.",
        "examples": [
            "The whistleblower revealed the accounting fraud to regulators.",
            "Internal memos revealed tensions between the board and management.",
            "The documentary revealed how the company evaded taxes for years."
        ]
    },
    {
        "name": "DISCLOSED",
        "description": "A person or organization formally disclosing information, often in official or regulatory contexts.",
        "examples": [
            "The bank disclosed a significant trading loss in its London office.",
            "The proxy statement disclosed executive compensation details.",
            "The company disclosed ongoing regulatory investigations in its annual filing."
        ]
    },
    {
        "name": "ANNOUNCED",
        "description": "A person or organization making a formal public announcement about a decision, event, or plan.",
        "examples": [
            "The technology company announced a major gaming acquisition.",
            "The central bank announced quantitative tightening.",
            "The aerospace manufacturer announced delays to its new aircraft program."
        ]
    },
    {
        "name": "INSPIRED_BY",
        "description": "An organization's structure, product, or strategy being inspired or influenced by another entity, person, or model.",
        "examples": [
            "The aerospace company's vertical integration was inspired by historic manufacturing plants.",
            "The smartphone design was inspired by minimalist industrial design aesthetics.",
            "The automaker's production system inspired lean manufacturing worldwide."
        ]
    },
    {
        "name": "MODELED_AFTER",
        "description": "An organization explicitly modeling its structure, operations, or approach after another entity.",
        "examples": [
            "The technology investment fund was modeled after sovereign wealth funds.",
            "The regional bloc's antitrust approach was modeled after US regulations.",
            "The retailer's membership model was modeled after wholesale clubs."
        ]
    },
    {
        "name": "ENCOURAGED",
        "description": "A person encouraging or urging another person or organization to take a specific action or make a decision.",
        "examples": [
            "The activist investor encouraged the company to increase its stock buyback program.",
            "The investor encouraged the board to consider a sale.",
            "Mentors at the accelerator encouraged the founders to pivot."
        ]
    },
    {
        "name": "ADVISED",
        "description": "A person or organization providing advice or counsel to another entity on a decision or strategy.",
        "examples": [
            "The investment bank advised the social media company on its sale.",
            "The consulting firm advised the automaker on its EV transition strategy.",
            "The former government official advised the startup on regulatory matters."
        ]
    },
    {
        "name": "RECOMMENDED",
        "description": "A person or organization making a formal recommendation about an action, investment, or decision.",
        "examples": [
            "The proxy advisory firm recommended voting against the merger.",
            "The investment bank recommended overweight on semiconductor stocks.",
            "The compensation committee recommended a raise for the CEO."
        ]
    },
    {
        "name": "WENT_PUBLIC",
        "description": "An entity completing an initial public offering (IPO) and becoming a publicly traded company.",
        "examples": [
            "The vacation rental platform went public at a multi-billion dollar valuation.",
            "The EV manufacturer completed its IPO, raising billions in one of the largest US listings."
        ]
    },
    {
        "name": "STOCK_SPLIT",
        "description": "An entity dividing its existing shares into multiple shares to boost liquidity and accessibility.",
        "examples": [
            "The e-commerce company executed a 20-for-1 stock split.",
            "The technology conglomerate completed a stock split to make shares more accessible to retail investors."
        ]
    },
    {
        "name": "DELISTED",
        "description": "An entity being removed from a stock exchange, either voluntarily or due to non-compliance.",
        "examples": [
            "The ride-hailing company was delisted after regulatory pressure from its home country.",
            "The company was delisted after failing to meet minimum share price requirements."
        ]
    },
    {
        "name": "RAISED_EQUITY",
        "description": "An entity raising capital by issuing new shares or equity securities. Distinct from debt issuance.",
        "examples": [
            "The automaker raised billions through an at-the-market equity offering.",
            "The SPAC raised capital in its IPO to acquire a target company."
        ]
    },
    {
        "name": "REFINANCED_DEBT",
        "description": "An entity replacing existing debt with new debt, often at better terms or extended maturity.",
        "examples": [
            "The automaker refinanced billions of its revolving credit facility.",
            "The company refinanced its upcoming maturities with lower-rate bonds."
        ]
    },
    {
        "name": "CREDIT_DOWNGRADE",
        "description": "A credit rating agency lowering an entity's credit rating, indicating increased default risk.",
        "examples": [
            "The rating agency downgraded the aerospace company following its aircraft safety crisis.",
            "The credit agency cut the company's rating to junk status after missed debt payments."
        ]
    },
    {
        "name": "CREDIT_UPGRADE",
        "description": "A credit rating agency raising an entity's credit rating, indicating improved creditworthiness.",
        "examples": [
            "The rating agency upgraded the streaming company to investment grade following strong cash flow.",
            "The credit agency raised the sovereign rating after fiscal reforms."
        ]
    },
    {
        "name": "FILED_WITH_REGULATOR",
        "description": "An entity submitting a required filing to a regulatory body such as the SEC, FDA, or FCC.",
        "examples": [
            "The technology company filed its annual 10-K report with the SEC.",
            "The biotech company filed an NDA with the FDA for its cancer drug."
        ]
    },
    {
        "name": "RECEIVED_APPROVAL",
        "description": "An entity receiving regulatory approval for a product, merger, or other action.",
        "examples": [
            "The pharmaceutical company received FDA approval for its vaccine.",
            "The merger received antitrust clearance from the FTC."
        ]
    },
    {
        "name": "DENIED_APPROVAL",
        "description": "An entity being denied regulatory approval for a product, merger, or other action.",
        "examples": [
            "The FDA denied approval for the experimental Alzheimer's drug.",
            "The FCC denied the spectrum license application."
        ]
    },
    {
        "name": "COVENANT_BREACH",
        "description": "An entity violating terms of a debt agreement, such as financial ratio requirements.",
        "examples": [
            "The retailer breached its debt-to-EBITDA covenant after weak holiday sales.",
            "The company disclosed a technical breach of its interest coverage covenant."
        ]
    },
    {
        "name": "COVENANT_WAIVED",
        "description": "Lenders agreeing to temporarily suspend or permanently remove debt covenant requirements.",
        "examples": [
            "Banks granted a covenant waiver to the airline during the pandemic.",
            "The company obtained a waiver for its leverage ratio covenant."
        ]
    },
    {
        "name": "RESTATED_FINANCIALS",
        "description": "An entity revising previously reported financial statements due to errors or accounting changes.",
        "examples": [
            "The company restated three years of financials after discovering revenue recognition errors.",
            "The industrial conglomerate restated its earnings following a regulatory investigation into accounting practices."
        ]
    },
    {
        "name": "MISSED_EARNINGS",
        "description": "An entity reporting earnings below analyst consensus expectations.",
        "examples": [
            "The chipmaker missed earnings estimates, reporting EPS below expectations.",
            "The retailer missed revenue expectations, sending shares lower."
        ]
    },
    {
        "name": "BEAT_EARNINGS",
        "description": "An entity reporting earnings above analyst consensus expectations.",
        "examples": [
            "The semiconductor company beat earnings expectations with record data center revenue.",
            "The bank beat EPS estimates on strong trading revenue."
        ]
    },
    {
        "name": "APPOINTED_EXECUTIVE",
        "description": "An entity naming a person to a senior leadership position. More specific than general hiring.",
        "examples": [
            "The board appointed a new CEO following the founder's resignation.",
            "The technology company appointed a new Chief Executive Officer."
        ]
    },
    {
        "name": "PROMOTED",
        "description": "An entity elevating an existing employee to a higher position within the organization.",
        "examples": [
            "The CFO was promoted to President and Chief Operating Officer.",
            "The company promoted the head of AI research to Senior Vice President."
        ]
    },
    {
        "name": "DISCONTINUED_PRODUCT",
        "description": "An entity ending production or support for a product or service line.",
        "examples": [
            "The technology company discontinued its social network after years of low engagement.",
            "The chipmaker discontinued its memory business."
        ]
    },
    {
        "name": "EXITED_MARKET",
        "description": "An entity withdrawing from a geographic or product market entirely.",
        "examples": [
            "The ride-hailing company exited the China market after selling to a local competitor.",
            "The retailer exited the UK market after sustained losses."
        ]
    },
    {
        "name": "SUPPLIES_TO",
        "description": "An entity providing components, materials, or services to another entity as a supplier.",
        "examples": [
            "The semiconductor foundry supplies chips to smartphone manufacturers.",
            "The glass manufacturer supplies specialized glass to major device makers."
        ]
    },
    {
        "name": "CUSTOMER_OF",
        "description": "An entity purchasing products or services from another entity as a customer.",
        "examples": [
            "The smartphone maker is a major customer of its competitor's display division.",
            "The cloud provider counts the streaming company as one of its largest customers."
        ]
    }
]